import React from "react";

const QuotesCard: React.FC = () => {
  return (
    <div className="card bg-base-100 p-4 sm:p-6 md:p-8">
      <div className="card-body">
        <h1 className="card-title text-2xl sm:text-3xl mb-4">
          Parent Testimonials
        </h1>
        <figure className="max-w-screen-md mx-auto flex flex-col items-center text-center mb-5">
          {/* Icon Section */}
          <svg
            className="w-10 h-10 mb-4"
            aria-hidden="true"
            xmlns="http://www.w3.org/2000/svg"
            fill="currentColor"
            viewBox="0 0 18 14"
          >
            <path d="M6 0H2a2 2 0 0 0-2 2v4a2 2 0 0 0 2 2h4v1a3 3 0 0 1-3 3H2a1 1 0 0 0 0 2h1a5.006 5.006 0 0 0 5-5V2a2 2 0 0 0-2-2Zm10 0h-4a2 2 0 0 0-2 2v4a2 2 0 0 0 2 2h4v1a3 3 0 0 1-3 3h-1a1 1 0 0 0 0 2h1a5.006 5.006 0 0 0 5-5V2a2 2 0 0 0-2-2Z" />
          </svg>

          {/* Quote Section */}
          <blockquote>
            <p className="lg:text-xl italic">
              "राघवच्या निमित्ताने प्रकाशी झालेली भेट हा, राघव बरोबरच ,आमच्याही
              आयुष्याला वेगळं वळण देणारा योग होता. जे चालू होतं त्यात बदल हवं
              होता पण हे homeschooling चे जग totally unknown होतं त्यावेळेला खूप
              जणांना जाऊन भेटलो होतो. त्यावेळी गोड गोड न बोलता खरा आरसा दाखवला
              तो प्रकानी. पण त्याला भेटून कुठेतरी एक प्रकारचा विश्वास वाटला.
              तुम्ही असं करा यापेक्षा आपण असं करू शकतो ही त्याची वाक्य त्यावेळी
              खूप आधार देऊन गेली.{" "}
            </p>
            <p className="lg:text-xl italic">
              मग हळूहळू ह्या प्रवासात त्याची आणि स्वातीची वेळोवेळी खूप मदत मिळत
              गेली.
            </p>
            <p className="lg:text-xl italic">
              मुल, ती family ह्यांच्या गरजा समजून घेऊन, त्याची जाणीव करून
              देत,प्रसंगी त्यासाठी आग्रह धरून, (आणि वाईटपणा ही घेत) त्याचे मत
              मांडणारा, त्या मार्गानी पुढे घेऊन जाणारा, ते करण्यासाठी खंबीरपणे
              पाठीशी उभा राहणारा, patiently, भरपूर वेळ देऊन पालकांच्या अनेक
              प्रश्नांचे निरसन करत राहणारा, नवीन गोष्टींसाठी करून बघव्यात
              ह्यासाठी सतत प्रेरणा देणारा, मायेनी involve करून घेणारा, मुलांनी
              आपणहून खूप काही करून बघावं, ह्यासाठी त्यांच्यासमोर अनेक गोष्टी
              विषय त्यांच्या समोर असावेत ह्यासाठी कायम प्रयत्नशील प्रका मला
              गेल्या 5 वर्षात दिसला, जाणवला..
            </p>
            <p className="lg:text-xl italic">
              ह्याला सगळ्यातलं सगळं कसं माहित असतं आणि एवढ्या ideas त्याला येतात
              कुठून हा प्रश्न मला कायम पडायचा..आणि आजही पडतो.. ☺️😀 तो
              स्वतःबद्दल अतिशय कमी बोलणारा पण गप्पांमधून त्याची journey हळू हळू
              समजत गेली.{" "}
            </p>
            <p className="lg:text-xl italic">
              अनेक लोकांबरोबर,संस्थांमधून तो वेगवेगळ्या माध्यमातून कार्यरत होता.
              अनेक मोठे projects त्यानी उभे करून दिले आहेत, भारताच्या
              कानकोपऱ्यात तो फिरलेला आहे, खेड्यापाड्यातला भारत त्यांनी अनुभवला
              आहे. आपल्या roots तो अतिशय connected आहे आणि म्हणूनच आपल्या
              तत्त्वांशी, विचारांशी एकनिष्ठ आहे असे वाटते..
            </p>
            <p className="lg:text-xl italic">
              त्याला पूर्ण साथ गौरीची आहे. ते दोघे वेगळे नाहीतच असे जाणवते. 🙂
              त्या दोघांनीही आपल्या वैयक्तिक आयुष्यात खूप गोष्टी करून बघितल्या
              आहेत,अनेक गोष्टी ते rigorously, नियमाने ते follow करतात आणि
              त्यांचे अनुभव मनापासून इतरांशी share ही करतात.
            </p>
            <p className="lg:text-xl italic">
              आमची सगळीच मतं, विचार जुळतात असं नाही, त्यावर हक्काने मी आणि
              स्वाती त्याला सांगत असतो.☺️😀 तो ही राग मानून न घेता गोष्टी
              स्वीकारतो आणि discussions साठी तो open असतो हे कायम जाणवतं.
              मतभेदांच्या पुढे जाऊन परत विचार करू,शोध घेऊ , तो योग्य पद्धतीने
              मांडू , feedback घेऊ आणि त्यावर प्रयत्न करतएकत्र पुढे जात राहू .
              हे त्याचे म्हणणे खूप appreciate होतं.
            </p>
            <p className="lg:text-xl italic">
              असा मितभाषी, कलाप्रेमी, साहित्यप्रेमी, संगीत प्रेमी, अत्यंत
              संवेदनशील, प्रेमळ, आपल्या प्रकाला 50 व्या वाढदिवसात पदार्पणाच्या
              खूप खूप शुभेच्छा..💐🎉 आरोग्य संपन्न आयुष्य त्याला लाभू देत. ज्या
              तळमळीने मुलांसाठी, पालकांसाठी तो काम उभं करू पहात आहे, जास्तीत
              जास्त लोकांनी त्याचा लाभ घेऊ देत. हीच सदिच्छा 💐💐🙂❤️"
            </p>
          </blockquote>

          {/* Author Section */}
          <figcaption className="mt-6">
            <cite className="font-medium">
              - Sukhada, Parent at Co-Hum Learning Center
            </cite>
          </figcaption>
        </figure>
      </div>
    </div>
  );
};

export default QuotesCard;
